/*Задание в файле, выбрать одно и выполнить как минимум все что указано в задании, больше лучше. 
Просьба использовать хотя бы 2 паттерна, больше лучше, каждый паттерн свыше 2 использованный правильно 
(начиная с третьего), +1 к оценке. 


Спроектировать объектные модели для заданных предметных областей.
Каждый конструктор, объект, метод и переменная должны иметь
исчерпывающее смысл название и информативный состав. Необходимо точно
продумать, какие конструкторы и объекты необходимы для решения задачи.
Наследование должно применяться только тогда, когда это имеет смысл.
Конструкторы должны быть грамотно разложены по модулям. Работа с консолью
или консольное меню должно быть минимальным (только необходимые данные
для ввода, выводить только то, что просится в условии задачи). Задание
представляет собой какую-то предметную область, в которой требуется
выделить необходимую иерархию и реализовать ее с помощью ООП (используя
наследование, если необходимо). Программа должна создавать объекты
различных классов в выделенной предметной области, объединять их в какой-то
набор объектов. Как правило, задание требует выполнить какое-то действие над
объектами в наборе объектов по заданным критериям. 



Варианты заданий:
1. Новогодний подарок. Определить иерархию конфет и прочих сладостей.
Создать несколько объектов-конфет. Собрать детский подарок с
определением его веса. Провести сортировку конфет в подарке на основе
одного из параметров. Найти конфету в подарке, соответствующую
заданному диапазону параметров.
2. Домашние электроприборы. Определить иерархию электроприборов.
Включить некоторые в розетку. Посчитать потребляемую мощность.
Провести сортировку приборов в квартире на основе одного из
параметров. Найти прибор в квартире, соответствующий заданному
диапазону параметров.
3. Шеф-повар. Определить иерархию овощей. Сделать салат. Посчитать
калорийность. Провести сортировку овощей для салата на основе одного
из параметров. Найти овощи в салате, соответствующие заданному
диапазону параметров.
4. Авиакомпания. Определить иерархию самолетов. Создать авиакомпанию.
Посчитать общую вместимость и грузоподъемность. Провести сортировку
самолетов компании по дальности полета. Найти самолет в компании,
соответствующий заданному диапазону параметров.
5. Таксопарк. Определить иерархию легковых автомобилей. Создать
таксопарк. Посчитать стоимость автопарка. Провести сортировку
автомобилей парка по расходу топлива. Найти автомобиль в компании,
соответствующий заданному диапазону параметров.

6. Игровая комната. Подготовить игровую комнату для детей разных
возрастных групп. Игрушек должно быть фиксированное количество в
пределах выделенной суммы денег. Должны встречаться игрушки
родственных групп, например: маленькие, средние и большие машины,
куклы, мячи, кубики. Провести сортировку игрушек в комнате по одному
из параметров. Найти игрушки в комнате, соответствующие заданному
диапазону параметров.
7. Туристические путевки. Сформировать набор предложений клиенту по
выбору туристической путевки различного типа (отдых, экскурсии,
лечение, шопинг, круиз и т.д.) для оптимального выбора. Учитывать
возможность выбора транспорта, питания и числа дней. Реализовать
выбор и сортировку путевок.*/

